[
  {
    "blogId": 1,
    "title": "Plant-Based Meat Alternatives",
    "author": "Dr. rajan nath  ,MBBS AIMS 2010",
    "content": "<h1>Incorporating Plant-Based Meat Alternatives into Your Healthy Diet</h1> <p>You’ve probably noticed that plant-based meats are becoming more widely available. These are products made with plant ingredients that can be used in recipes that traditionally use meat, making them vegan or vegetarian.</br>As someone who follows a plant-based diet, I can attest that many meatless alternatives can be used in the same ways you might use meat. For example, there are meatless burgers, hot dogs, bacon, ground crumbles, meatballs, and even deli slices.</br>Many of them are so versatile and delicious that people who don’t necessarily follow a plant-based diet enjoy eating them too.</br>However, despite their popularity, you may be wondering whether plant-based meat alternatives are healthy.</br>This article examines the nutritional value of some of the most commonly used plant-based meat alternatives, as well as benefits and downsides to consider.</p> <h2>Types of plant-based meat alternatives</h2> <p>A growing number of plant-based meat alternatives are available today. Let’s take a look at some of the more popular varieties</p> <h3>Seitan</h3> <p>Seitan is a plant-based meat substitute made from vital wheat gluten. It has a savory flavor and chewy texture that works well in stir-fry, sandwiches, stews, and pasta dishes.</br>Nutritionally, seitan is a high protein plant-based meat alternative. It generally also contains small amounts of iron, calcium, and potassium (1Trusted Source, 2).</br>In many grocery stores, you can find seitan in the form of cubes, strips, or thin deli slices that are ready to use.</br>You can also make seitan at home using vital wheat gluten, vegetable broth, and flavoring agents such as soy sauce or liquid aminos and garlic. All you have to do is combine ingredients in a mixer, create a dough, and then boil slices of the dough to cook it.</br>However, because it’s made with gluten, seitan isn’t appropriate for people who have celiac disease or non-celiac gluten sensitivity.</p> <h3>Beyond Meat products</h3> <p>Beyond Meat is a popular brand of plant-based meat products. While it was initially recognized for its debut vegan burger, called the Beyond Burger, this brand now also makes plant-based ground meat, sausage, meatballs, and chicken.</br>The primary ingredient in a Beyond Burger is pea protein. It also contains refined coconut oil, rice protein, cocoa butter, and dried yeast.</br>Beyond Burgers are free from soy and gluten and are naturally colored using beet juice. One patty provides 100% of the Daily Value for vitamin B12, 40% for zinc, and 20% for iron (3).</p>",
    "datePublished": "25/06/2022",
    "dateModified": "25/06/2022",
    "imageSrc": "https://i0.wp.com/post.healthline.com/wp-content/uploads/2021/09/veggie-meatless-burger-on-plate-1296-728-header.jpg?w=1575"
  },
  {
    "blogId": 2,
    "title": "What to Know About Using TikTok as a Mental Health Resource",
    "author": "Dr. sajaan misra ,MBBS AIMS 2015",
    "content": "<h1>What to Know About Using TikTok as a Mental Health Resource</h1><p>TikTok, the social media app known for its short-form videos, has been one of the most popular social media platforms in the United States since 2018.But it was during the pandemic that TikTok skyrocketed to superstardom, with a reported 850 million downloads worldwide during 2020.TikTok has now become a platform for thousands of healthcare professionals, including psychiatrists, therapists, and mental health advocates, who use the app’s widespread reach to talk to audiences about everything from depression to ADHD.</p><h2>Barriers for mental health</h2><p>In 2020 52.9 million Americans lived with mental illnessTrusted Source. That’s nearly one in five adults.According to the National Institute of Mental Health, any mental illness (AMI) is defined as a mental, behavioral, or emotional disorder. It can range from no impairment to mild, moderate, and even severe.Still, with such a high percentage of people living with mental health issues, there are many barriers to seeking and obtaining mental health for Americans. A 2021 study sampled 50,103 adults, of which 95.6% reported at least one barrier to healthcare accessTrusted Source. Some of the barriers reported included approachability, meaning not having a place that one usually goes to when they are sick or need advice; availability, meaning lack of ability to get an appointment or find an open office; and affordability, meaning cost per session.Because of these barriers, only about half of Americans who live with mental health issues receive mental health servicesTrusted Source.According to Pew Research, 85 percent of Americans own a smartphone. There has never been more access to information than there has been right now, including access to apps like TikTok and the content shared on its platform. Because of this widespread accessibility and the fact that mental health illness has increased so dramaticallyTrusted Source over the course of the pandemic, it’s not a surprise why experts and advocates have taken to TikTok to amplify information on how best to address mental health.“A clear benefit is accessibility of information — TikTok is a free service that anyone with internet access can utilize,” said Naomi Torres-Mackie, PhD, a psychologist at Lenox Hill Hospital in New York.Lindsay Fleming, a licensed therapist, is one particular mental health expert who has harnessed TikTok to reach a wide audience. She had been leading a middle school girls group but had to cancel the group sessions because of COVID-19.“Some of the participants reached out about how they missed the group, so I created a TikTok to help support my community, and one of my videos went viral,” she said. “Then I started to see the impact the videos I created had on others. Many people were struggling, but connecting with TikTok helped them feel less alone and find the courage to ask for help not only from my videos but many other mental health advocates and therapists on TikTok.”Fleming connects with people on TikTok and builds a community through her videos that focus on the nuances of therapy. She also hosts weekly “lives” (or live sessions) where she does a check-in and answers questions that her community may have. Over time, her account has grown to reach more than half a million followers — a testament to how many people out there are looking for a way to connect.</p><h2>Drawbacks of TikTok for mental health</h2><p>As with anything else on the internet, verification is the number one drawback to using TikTok, or any social media, for something as important as mental health.Who are the professionals on the other side of the screen, and are they who they say they are? Just as important, is the advice they give trusted and clinically proven? Mental health is not something to be taken lightly or flippantly, and just because someone may have a platform to share their advice does not necessarily mean that it is expertise.“A major downside is that information on TikTok can be false, misleading, or confusing,” said Torres-Mackie. “Even when valid information is presented without context as it often is on social media, it can lead to false conclusions. Say, for example, a clinician on TikTok discusses a symptom of ADHD that you experience. Without the full context of all the clinical criteria of ADHD and a diagnostic exam, it is impossible to know if you truly have the condition.”Be aware that there are countless people on social media without formal mental health training or with training in another area of expertise who speak on topics about which they are not fully informed. It can be easy to take some information or advice that is presented online and apply it to yourself in a way that is inaccurate.Torres-Mackie also reminds us that being on social media itself can be damaging to mental health. “If you are opening social media apps to get mental health information, there’s a high likelihood you will drift to other content that is not supportive of mental wellbeing.”</p>",
    "datePublished": "22/06/2022",
    "dateModified": "22/06/2022",
    "imageSrc": "https://i2-prod.dailystar.co.uk/incoming/article25925724.ece/ALTERNATES/s1200/0_Brits-spend-a-third-of-time-awake-on-apps.jpg"
  },
  {
    "blogId": 3,
    "title": "control blood sugar",
    "author": "Dr. amish mehra ,MBBS AIMS 2013",
    "content": "<h1>Control Blood Sugar</h1><p>High blood sugar, also known as hyperglycemia, is associated with diabetes and prediabetes. Prediabetes is when your blood sugar is high, but not high enough to be classified as diabetes.Your body usually manages your blood sugar levels by producing insulin, a hormone that allows your cells to use the circulating sugar in your blood. As such, insulin is the most important regulator of blood sugar levels .However, multiple factors can impair blood sugar management and lead to hyperglycemia.Internal causes for high blood sugar include when your liver produces too much glucose, your body makes too little insulin, or your body can’t effectively use insulin. The latter is known as insulin resistance .External factors include dietary choices, certain medications, a sedentary lifestyle, and stress.The Centers for Disease Control and Prevention (CDC) reports that 13% of U.S. adults live with diabetes and that another 34.5% have prediabetes. This means that close to 50% of all U.S. adults have diabetes or prediabetes .Blood sugar management is especially important for people with diabetes, as chronically high blood sugar levels can lead to limb and life threatening complications</p><h2>Here are 2 easy and evidence-backed ways to naturally lower your blood sugar levels</h2><h3>1.Exercise regularly</h3><p>Regular exercise can help you reach and maintain a moderate weight and increase insulin sensitivity .Increased insulin sensitivity means your cells can more effectively use the available sugar in your bloodstream.Exercise also helps your muscles use blood sugar for energy and muscle contraction .If you have problems with blood sugar management, consider routinely checking your levels before and after exercising. This will help you learn how you respond to different activities and keep your blood sugar levels from getting too high or low.What’s more, researchers recommend doing so-called “exercise snacks” to lower blood sugar and prevent the damage that sitting all day can do.Exercise snacks simply mean that you break up your sitting time every 30 minutes for just a few minutes throughout the day. Some of the recommended exercises include light walking or simple resistance exercises like squats or leg raises.Other useful forms of exercise include weightlifting, brisk walking, running, biking, dancing, hiking, swimming, and more. In fact, any activity that regularly gets you up and moving — regardless of the intensity — beats a sedentary lifestyle.Plus, know that if you have trouble dedicating longer periods to exercise throughout the week, you can still gain many benefits by doing shorter sessions. For example, try aiming for 10-minute exercise sessions 3 times a day for 5 days, with the goal of 150 minutes per week</p><h3>2.Manage your carb intake</h3><p>Your carb intake strongly influences your blood sugar levels .Your body breaks carbs down into sugars, mainly glucose. Then, insulin helps your body use and store it for energy.When you eat too many carbs or have insulin-function problems, this process fails, and blood glucose levels can rise.That’s why the American Diabetes Association (ADA) recommends that people with diabetes manage their carb intake by counting carbs and being aware of how many they need .Some studies find that this can help you plan your meals appropriately, further improving blood sugar management.Many studies also show that eating a low carb diet helps reduce blood sugar levels and prevent blood sugar spikes.It’s important to note that low carb diets and no carb diets are not the same.You can still eat some carbs when monitoring your blood sugar. However, prioritizing whole grains over processed ones and refined carbs provides greater nutritional value while helping decrease your blood sugar levels</p>",
    "datePublished": "28/06/2022",
    "dateModified": "28/06/2022",
    "imageSrc": "https://image.shutterstock.com/image-photo/white-sugar-wooden-bowl-scoop-260nw-1046986462.jpg"
  },
  {
    "blogId": 4,
    "title": "Everything You Need to Create the Bedroom of Your Dreams",
    "author": "Dr. sleepy head ,MBBS AIMS 1900",
    "content": "<h1>Everything You Need to Create the Bedroom of Your Dreams</h1><p>When it comes to bedroom design, many people focus on elements that reflect their needs when they’re awake.</br>Clothes on the chair? Easier to grab in the morning. Cluttered furniture? You need your bed, desk, dresser, and chair. Overflowing laundry hamper? With everything you have to do, laundry is pretty low on your priority list.</br>You also keep your computer and phone close at hand, since you never know when you might need them. You try to avoid looking at them after you turn off the lights, but your resolve doesn’t always stick — especially when you have trouble falling asleep.</br>Your bedroom might offer convenience by day, but there’s a chance it has a different impact at night. Even if all you do is sleep in your bedroom, you still spend about a third of each day there. A hot, bright, cluttered room can disrupt your sleep and keep you lying awake for a chunk of this time, which can mean bad news for your waking health.</br>But, here’s the good news: Updating your bedroom can help you get better sleep, which can, in turn, improve overall well-being. Our guide below can help you get started.</p><h2>Tips for creating your ideal sleep oasis</h2><p>Making a few changes can help you create a more comfortable sleep environment. According to sleep experts at Johns Hopkins, the following bedroom features can make a big difference in the quality of your sleep:</p><h4>Temperature</h4><p>A cooler room and bed can reduce nighttime sweating and improve sleep. Aim to keep your bedroom thermostat set to 65°F, give or take a few degrees.</p><h4>Light</h4><p>Bright blue lightTrusted Source, be it from the sun or electronics, can disrupt sleep. Putting down your devices, using blackout curtains, and using very dim lights at night can improve your rest.</p><h4>Pets</h4><p>You can love your furry friends without loving their nighttime commotion. If you’re unable to get good sleep with a restless pet, consider keeping them off the bed.</p><h4>Tidiness</h4><p>You may not see your bedroom clutter while you sleep, but it could still have an impact on your rest. For better sleep, try tidying up and making your bed each day.</p>",
    "datePublished": "28/06/2022",
    "dateModified": "28/06/2022",
    "imageSrc": "https://i0.wp.com/post.healthline.com/wp-content/uploads/2021/01/920225-The-Ultimate-Guide-for-Creating-the-Perfect-Bedroom-for-Sleep-1296x728-Header.png?h=1530"
  }
]